package Homework.Lesson12.documentProcessingValidation;

/*Архитектурные шаги и требования:
1 Считывание путей к файлам:
Программа считывает с консоли пути к файлам. Каждая новая строка — путь к файлу и его имя.
Ввод прекращается при вводе символа 0.
Все пути сохраняются в коллекцию типа List (используйте ArrayList).
2 Считывание и дедупликация номеров документов:
Файлы содержат по одному номеру документа на строку (без посторонней информации).
Номера документов могут повторяться как в пределах одного файла, так и между разными файлами.
Чтобы исключить повторную валидацию дубликатов, все считанные номера сохраняйте в коллекцию типа Set
(используйте HashSet).
3 Правила валидации:
Номер документа валиден, если его длина строго 15 символов и он начинается с последовательности
 docnum или kontract (далее любая последовательность букв/цифр).
В противном случае номер считается невалидным (с указанием конкретной причины).
4 Формирование отчета:
Результаты проверки сохраняются в структуру Map (используйте HashMap), где:
Ключ: номер документа.
Значение: статус и комментарий (валиден / не валиден и по какой причине).
В конце работы программы пройдите циклом по этой Map и запишите всю информацию в итоговый файл-отчет.*/

import java.util.ArrayList;
import java.util.List;
import java.util.Scanner;

public class ReadingFilePaths {

    public static List<String> getFilePaths() {
        List<String> paths = new ArrayList<>();
        Scanner scanner = new Scanner(System.in);

        System.out.println("Для окончания введите '0' ");
        System.out.println("Введите путь к файлам: ");

        while (scanner.hasNextLine()){
            String input = scanner.nextLine().trim();
            if ("0".equals(input)) {
                break;
            }
            if (!input.isEmpty()) {
                paths.add(input);
            }
        }
        return paths;
    }
}
