package Homework.Lesson12.documentProcessingValidation;

/*Архитектурные шаги и требования:
1 Считывание путей к файлам:
Программа считывает с консоли пути к файлам. Каждая новая строка — путь к файлу и его имя.
Ввод прекращается при вводе символа 0.
Все пути сохраняются в коллекцию типа List (используйте ArrayList).
2 Считывание и дедупликация номеров документов:
Файлы содержат по одному номеру документа на строку (без посторонней информации).
Номера документов могут повторяться как в пределах одного файла, так и между разными файлами.
Чтобы исключить повторную валидацию дубликатов, все считанные номера сохраняйте в коллекцию типа Set
(используйте HashSet).
3 Правила валидации:
Номер документа валиден, если его длина строго 15 символов и он начинается с последовательности
 docnum или kontract (далее любая последовательность букв/цифр).
В противном случае номер считается невалидным (с указанием конкретной причины).
4 Формирование отчета:
Результаты проверки сохраняются в структуру Map (используйте HashMap), где:
Ключ: номер документа.
Значение: статус и комментарий (валиден / не валиден и по какой причине).
В конце работы программы пройдите циклом по этой Map и запишите всю информацию в итоговый файл-отчет.*/


import java.util.HashMap;
import java.util.Map;
import java.util.Set;

public class ValidationRules {
    public static Map<String, String> validate(Set<String> docNumbers) {
        Map<String, String> report = new HashMap<>();

        for (String doc : docNumbers) {
            if (doc.length() != 15) {
                report.put(doc, "Невалиден, длина должна составлять 15 символов");
                continue;
            }

            boolean startCorrectly = doc.startsWith("docnum") || doc.startsWith("kontract");
            if (startCorrectly) {
                report.put(doc, "Валиден");
            } else {
                report.put(doc, "Невалиден, документ должен начинаться с 'docnum' и 'kontract'.");
            }
        }
        return report;
    }
}
